#include <iostream>
#include <vector>

int main()
{
	std::vector<std::string> when = {
		"Сразу после того как умер иисус",
		"Выгуливая свою собаку",
		"Однажды",
		"Както раз",
		"В 1920 году",
		"Вчера",
		"Сегодня в 23:59",
	};
	std::vector<std::string> where = {
		"в Великом храме города Ханой под собором отмечающим середину мира",
		"в подвале, в доме своих родителей",
		"в одном из кратеров на поверхности луны",
		"в деревне Чепелево в окрестности",
		"я вспомнил свой любимый фильм в котором",
		"я вспомнил свой сон в котором",
	};
	std::vector<std::string> who = {
		"",
		"",
		"",
		"",
		"",
		"",
	};
}